AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.2.alpha.1.1/mcu/apollo510L/regs/am_mcu_apollo510L_otpinfo0.h
//*****************************************************************************
//
//  am_mcu_apollo510l_otpinfo0.h
//
//*****************************************************************************

//*****************************************************************************
//
// Copyright (c) 2025, Ambiq Micro, Inc.
// All rights reserved.
//
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:
//
// 1. Redistributions of source code must retain the above copyright notice,
// this list of conditions and the following disclaimer.
//
// 2. Redistributions in binary form must reproduce the above copyright
// notice, this list of conditions and the following disclaimer in the
// documentation and/or other materials provided with the distribution.
//
// 3. Neither the name of the copyright holder nor the names of its
// contributors may be used to endorse or promote products derived from this
// software without specific prior written permission.
//
// Third party software included in this distribution is subject to the
// additional license terms as defined in the /docs/licenses directory.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//
// This is part of revision release_sdk5_2_a_1_1-c2486c8ef of the AmbiqSuite Development Package.
//
//*****************************************************************************

#ifndef AM_REG_OTP_INFO0_H
#define AM_REG_OTP_INFO0_H

#define AM_REG_OTP_INFO0_BASEADDR 0x42004000

#define AM_REG_OTP_INFO0_SIGNATURE0_O 0x00000000
#define AM_REG_OTP_INFO0_SIGNATURE0_ADDR 0x42004000
#define AM_REG_OTP_INFO0_SIGNATURE1_O 0x00000004
#define AM_REG_OTP_INFO0_SIGNATURE1_ADDR 0x42004004
#define AM_REG_OTP_INFO0_SIGNATURE2_O 0x00000008
#define AM_REG_OTP_INFO0_SIGNATURE2_ADDR 0x42004008
#define AM_REG_OTP_INFO0_SIGNATURE3_O 0x0000000c
#define AM_REG_OTP_INFO0_SIGNATURE3_ADDR 0x4200400c
#define AM_REG_OTP_INFO0_BLRESET_O 0x00000010
#define AM_REG_OTP_INFO0_BLRESET_ADDR 0x42004010
#define AM_REG_OTP_INFO0_RESERVED_TRIM_O 0x00000014
#define AM_REG_OTP_INFO0_RESERVED_TRIM_ADDR 0x42004014
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_O 0x00000028
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_ADDR 0x42004028
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_O 0x0000002c
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_ADDR 0x4200402c
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG2_O 0x00000030
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG2_ADDR 0x42004030
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG3_O 0x00000034
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG3_ADDR 0x42004034
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG4_O 0x00000038
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG4_ADDR 0x42004038
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG5_O 0x0000003c
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG5_ADDR 0x4200403c
#define AM_REG_OTP_INFO0_SECURITY_VERSION_O 0x00000040
#define AM_REG_OTP_INFO0_SECURITY_VERSION_ADDR 0x42004040
#define AM_REG_OTP_INFO0_SECURITY_SRAM_RESV_O 0x00000044
#define AM_REG_OTP_INFO0_SECURITY_SRAM_RESV_ADDR 0x42004044
#define AM_REG_OTP_INFO0_SECURITY_RMAOVERRIDE_O 0x00000048
#define AM_REG_OTP_INFO0_SECURITY_RMAOVERRIDE_ADDR 0x42004048
#define AM_REG_OTP_INFO0_WIRED_TIMEOUT_O 0x00000054
#define AM_REG_OTP_INFO0_WIRED_TIMEOUT_ADDR 0x42004054
#define AM_REG_OTP_INFO0_SBR_SDCERT_ADDR_O 0x00000058
#define AM_REG_OTP_INFO0_SBR_SDCERT_ADDR_ADDR 0x42004058
#define AM_REG_OTP_INFO0_MAINPTR_O 0x00000060
#define AM_REG_OTP_INFO0_MAINPTR_ADDR 0x42004060
#define AM_REG_OTP_INFO0_CERTCHAINPTR_O 0x00000064
#define AM_REG_OTP_INFO0_CERTCHAINPTR_ADDR 0x42004064
#define AM_REG_OTP_INFO0_MRAM_RCVY_CTRL_O 0x00000068
#define AM_REG_OTP_INFO0_MRAM_RCVY_CTRL_ADDR 0x42004068
#define AM_REG_OTP_INFO0_NV_METADATA_OFFSET_O 0x0000006c
#define AM_REG_OTP_INFO0_NV_METADATA_OFFSET_ADDR 0x4200406c
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_O 0x00000070
#define AM_REG_OTP_INFO0_NV_PWR_RESET_CFG_ADDR 0x42004070
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_O 0x00000074
#define AM_REG_OTP_INFO0_NV_PIN_NUMS_ADDR 0x42004074
#define AM_REG_OTP_INFO0_NV_CE_CMD_PINCFG_O 0x00000078
#define AM_REG_OTP_INFO0_NV_CE_CMD_PINCFG_ADDR 0x42004078
#define AM_REG_OTP_INFO0_NV_CLK_PINCFG_O 0x0000007c
#define AM_REG_OTP_INFO0_NV_CLK_PINCFG_ADDR 0x4200407c
#define AM_REG_OTP_INFO0_NV_DATA_PINCFG_O 0x00000080
#define AM_REG_OTP_INFO0_NV_DATA_PINCFG_ADDR 0x42004080
#define AM_REG_OTP_INFO0_NV_DQS_PINCFG_O 0x00000084
#define AM_REG_OTP_INFO0_NV_DQS_PINCFG_ADDR 0x42004084
#define AM_REG_OTP_INFO0_NV_CONFIG0_O 0x00000088
#define AM_REG_OTP_INFO0_NV_CONFIG0_ADDR 0x42004088
#define AM_REG_OTP_INFO0_NV_CONFIG1_O 0x0000008c
#define AM_REG_OTP_INFO0_NV_CONFIG1_ADDR 0x4200408c
#define AM_REG_OTP_INFO0_NV_CONFIG2_O 0x00000090
#define AM_REG_OTP_INFO0_NV_CONFIG2_ADDR 0x42004090
#define AM_REG_OTP_INFO0_NV_CONFIG3_O 0x00000094
#define AM_REG_OTP_INFO0_NV_CONFIG3_ADDR 0x42004094
#define AM_REG_OTP_INFO0_NV_OPTIONS_O 0x00000098
#define AM_REG_OTP_INFO0_NV_OPTIONS_ADDR 0x42004098
#define AM_REG_OTP_INFO0_NV_MSPI_PRECMDS_O 0x0000009c
#define AM_REG_OTP_INFO0_NV_MSPI_PRECMDS_ADDR 0x4200409c
#define AM_REG_OTP_INFO0_MRAM_RCV_RETRIES_TIMES_O 0x000000a0
#define AM_REG_OTP_INFO0_MRAM_RCV_RETRIES_TIMES_ADDR 0x420040a0

// SIGNATURE0 - Word 0 (low word, bits 31:0) of the 128-bit INFO0 signature.
#define AM_REG_OTP_INFO0_SIGNATURE0_SIG0_S 0
#define AM_REG_OTP_INFO0_SIGNATURE0_SIG0_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_SIGNATURE0_SIG0(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_SIGNATURE0_SIG0_Pos 0
#define AM_REG_OTP_INFO0_SIGNATURE0_SIG0_Msk 0xFFFFFFFF

// SIGNATURE1 - Word 1 (bits 63:32) of the 128-bit INFO0 signature.
#define AM_REG_OTP_INFO0_SIGNATURE1_SIG1_S 0
#define AM_REG_OTP_INFO0_SIGNATURE1_SIG1_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_SIGNATURE1_SIG1(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_SIGNATURE1_SIG1_Pos 0
#define AM_REG_OTP_INFO0_SIGNATURE1_SIG1_Msk 0xFFFFFFFF

// SIGNATURE2 - Word 2 (bits 95:64) of the 128-bit INFO0 signature.
#define AM_REG_OTP_INFO0_SIGNATURE2_SIG2_S 0
#define AM_REG_OTP_INFO0_SIGNATURE2_SIG2_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_SIGNATURE2_SIG2(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_SIGNATURE2_SIG2_Pos 0
#define AM_REG_OTP_INFO0_SIGNATURE2_SIG2_Msk 0xFFFFFFFF

// SIGNATURE3 - Word 3 (high word, bits 127:96) of the 128-bit INFO0 signature.
#define AM_REG_OTP_INFO0_SIGNATURE3_SIG3_S 0
#define AM_REG_OTP_INFO0_SIGNATURE3_SIG3_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_SIGNATURE3_SIG3(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_SIGNATURE3_SIG3_Pos 0
#define AM_REG_OTP_INFO0_SIGNATURE3_SIG3_Msk 0xFFFFFFFF

